Documents/Requests/Soap_SearchLegacy- API Model E_02_02_2022_10_42_06_Request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:vfd="http://amdocs/vfde/customer/VFDELegacySearch" xmlns:vfd1="http://amdocs/vfde/customer/VFDELegacySearchInput">
  <soapenv:Header />
  <soapenv:Body>
    <vfd:LegacySearchRequest>
      <vfd1:ROOT>
        <Event>
          <Type>SearchCustomerFromLegacy</Type>
          <ID>13583532125d3ec024e58d30.06123278</ID>
          <CallerID>OSF</CallerID>
          <CorrelationID>le1l0qgv9hbegmhdg27l3o2sl2</CorrelationID>
          <FrontendUserId>1</FrontendUserId>
        </Event>
        <DATA>
          <BackendInd>KD</BackendInd>
          <KDSearchInput>
            <Id>931385163</Id>
          </KDSearchInput>
        </DATA>
      </vfd1:ROOT>
    </vfd:LegacySearchRequest>
  </soapenv:Body>
</soapenv:Envelope>